# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO11 + VersatileTeacher (teacher-student cross-domain) taps.
# This config keeps the standard YOLO11 Detect head, and adds
# Image/Instance domain-classifier "taps" that do not alter the forward tensor.

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11 head + VT taps
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 22 (P5/32-large)

  # Domain-classifier placement (aligned with VersatileTeacher yolov5l_da.yaml intent):
  # - Image-level taps on backbone features (P3/P4/P5): layers 4, 6, 8 (align with VT yolov5l_da.yaml)
  # - Instance-level taps on head features before Detect (P3/P4/P5): layers 16, 19, 22
  - [4, 1, VTImageDomainTap, [80, 0.1]] # 26 (backbone P3, 640/8=80)
  - [6, 1, VTImageDomainTap, [40, 0.1]] # 27 (backbone P4, 640/16=40)
  - [8, 1, VTImageDomainTap, [20, 0.1]] # 28 (backbone P5, 640/32=20)
  - [16, 1, VTInstanceDomainTap, [0.1, True]] # 29
  - [19, 1, VTInstanceDomainTap, [0.1, True]] # 30
  - [22, 1, VTInstanceDomainTap, [0.1, True]] # 31

  - [[16, 19, 22], 1, Detect, [nc]] # 32 Detect(P3, P4, P5)
